read_verilog counter.v
read_verilog -lib turingtumble/cells.v

synth
dfflibmap -liberty turingtumble/cells.lib
abc -liberty turingtumble/cells.lib
opt_clean

stat -liberty turingtumble/cells.lib

write_verilog synth.v